---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetLayoutPattern
source: html/e6cb4310-e6a2-2919-d5b5-a167aa796962.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetLayoutPattern Property

The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongFabricSheetLayoutPattern { get; }
```